code-review/NRB_3471_3546/База_Было/Catalogs/ФормыW8.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ФормыW8</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Лицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФормы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФормW8</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Посредник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЛицаАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПредоставления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаГражданства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаНалоговогоРезиденстваЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаНалоговогоРезидентстваВыгодоприобретателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПМЖ_Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПМЖ_АдресДом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПМЖ_Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПМЖ_Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПочтовый_Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПочтовый_АдресДом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПочтовый_Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПочтовый_Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН_TIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GIINЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GIINСпонсирующейКомпании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеСпонсирующейКомпании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяСтавкаДивиденды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаДивиденды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяСтавкаКупоны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаКупоны</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПоГлаве3USTAXCODE</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыUSTAXCODEгл3</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПоГлаве4USTAXCODE</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыUSTAXCODEгл4</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйКодСублиентаПоДаннымСубброкера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пул</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФормыСУДК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыФормW8.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыФормW8</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФормаW8BEN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаW8BENE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаW8IMY</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/ФормыW8/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДопСвойства = Неопределено;
	Если ЭтаФорма.Параметры.ЗначенияЗаполнения.Свойство("ДополнительныеСвойства",ДопСвойства) Тогда
		СоздатьСубклиентаПоДаннымАнкеты = Ложь;
		Если ДопСвойства.Свойство("СоздатьСубклиентаПоДаннымАнкеты",СоздатьСубклиентаПоДаннымАнкеты) Тогда
			ЭтаФорма.СоздатьСубклиентаПоДаннымАнкеты = СоздатьСубклиентаПоДаннымАнкеты;
			ЭтаФорма.РазрешитьСозданиеСубклиента = Истина;
		КонецЕсли;
		Контрагент = Неопределено;
		Если ДопСвойства.Свойство("Контрагент",Контрагент) Тогда
			ЭтаФорма.Контрагент = Контрагент;
		КонецЕсли;
		ДобавитьВПредоставленныеДокументы = Ложь;
		Если ДопСвойства.Свойство("ДобавитьВПредоставленныеДокументы",ДобавитьВПредоставленныеДокументы) Тогда
			ЭтаФорма.ДобавитьВПредоставленныеДокументы = ДобавитьВПредоставленныеДокументы;
			ЭтаФорма.РазрешитьДобавлениеВПредоставленныеДокументы = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьТипыФорм(ЭтаФорма);
	ОбновитьДоступностьСтавок(ЭтаФорма);
	ОбновитьВидимостьКонтрагента(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	НачислитьКомиссиюДепо = РегистрыСведений.ДокументыКНачислениюКомиссииДепо.НеобходимоНачислитьКомиссию(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РегистрыСведений.ДокументыКНачислениюКомиссииДепо.УстановитьЗначение(ТекущийОбъект.Ссылка, НачислитьКомиссиюДепо);
КонецПроцедуры

&НаКлиенте
Процедура ТипФормыПриИзменении(Элемент)
	СформироватьНаименованиеФормы();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеЛицаАнглПриИзменении(Элемент)
	СформироватьНаименованиеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЛицоПриИзменении(Элемент)
	
	Объект.ТипФормы = ПредопределенноеЗначение("Перечисление.ТипыФормW8.ПустаяСсылка");
	ОбновитьТипыФорм(ЭтаФорма);
	ОбновитьВидимостьКонтрагента(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяСтавкаДивидендыПриИзменении(Элемент)
	
	ОбновитьДоступностьСтавок(ЭтаФорма);
	Если НЕ Объект.ИспользуетсяСтавкаДивиденды Тогда
		Объект.СтавкаДивиденды = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяСтавкаКупоныПриИзменении(Элемент)
	
	ОбновитьДоступностьСтавок(ЭтаФорма);
	Если НЕ Объект.ИспользуетсяСтавкаКупоны Тогда
		Объект.СтавкаКупоны = 0;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура СформироватьНаименованиеФормы()
	
	Если ЗначениеЗаполнено(Объект.НаименованиеЛицаАнгл) И ЗначениеЗаполнено(Объект.ТипФормы) Тогда
		Объект.Наименование = Объект.НаименованиеЛицаАнгл + " (" + Объект.ТипФормы + ")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТипыФорм(Форма)
	
	СписокВыбора = Форма.Элементы.ТипФормы.СписокВыбора;
	Объект = Форма.Объект;
	
	Форма.Элементы.ТипФормы.Доступность = ЗначениеЗаполнено(Объект.Лицо) ИЛИ Форма.СоздатьСубклиентаПоДаннымАнкеты;
	
	СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(Объект.Лицо) Тогда
		Если ТипЗнч(Объект.Лицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФормW8.ФормаW8BEN"));
		Иначе
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФормW8.ФормаW8BENE"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФормW8.ФормаW8IMY"));
		КонецЕсли;
	ИначеЕсли Форма.СоздатьСубклиентаПоДаннымАнкеты Тогда
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФормW8.ФормаW8BEN"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФормW8.ФормаW8BENE"));
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДоступностьСтавок(Форма)
	
	Форма.Элементы.СтавкаДивиденды.Доступность = Форма.Объект.ИспользуетсяСтавкаДивиденды;
	Форма.Элементы.СтавкаКупоны.Доступность = Форма.Объект.ИспользуетсяСтавкаКупоны;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьКонтрагента(Форма)
	
	Если Форма.РазрешитьСозданиеСубклиента И НЕ ЗначениеЗаполнено(Форма.Объект.Лицо) Тогда
		ВидимостьГалкиСоздания = Истина;
	Иначе
		ВидимостьГалкиСоздания = Ложь;
		Форма.СоздатьСубклиентаПоДаннымАнкеты = Ложь;
	КонецЕсли;
	
	Если Форма.РазрешитьДобавлениеВПредоставленныеДокументы Тогда
		ВидимостьГалкиДобавления = Истина;
	Иначе
		ВидимостьГалкиДобавления = Ложь;
		Форма.ДобавитьВПредоставленныеДокументы = Ложь;
	КонецЕсли;
	
	Форма.Элементы.СоздатьСубклиентаПоДаннымАнкеты.Видимость = ВидимостьГалкиСоздания;
	Форма.Элементы.ДобавитьВПредоставленныеДокументы.Видимость = ВидимостьГалкиДобавления;
	
	Форма.Элементы.ГруппаКонтрагент.Видимость = ВидимостьГалкиСоздания ИЛИ ВидимостьГалкиДобавления;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСубклиентаПоДаннымАнкетыПриИзменении(Элемент)
	ОбновитьТипыФорм(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДобавитьВПредоставленныеДокументы",ДобавитьВПредоставленныеДокументы);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СоздатьСубклиентаПоДаннымАнкеты",СоздатьСубклиентаПоДаннымАнкеты);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Контрагент",Контрагент);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если СоздатьСубклиентаПоДаннымАнкеты Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("Объект");
		Если Индекс<>Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
		СпрОбъект = РеквизитФормыВЗначение("Объект");
		СпрОбъект.ДополнительныеСвойства.Вставить("СоздатьСубклиентаПоДаннымАнкеты",СоздатьСубклиентаПоДаннымАнкеты);
		СпрОбъект.ДополнительныеСвойства.Вставить("Контрагент",Контрагент);
		Если НЕ СпрОбъект.ПроверитьЗаполнение() Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	РазрешитьДобавлениеВПредоставленныеДокументы = Ложь;
	ОбновитьВидимостьКонтрагента(ЭтаФорма);
КонецПроцедуры
